tutorials/multicomponentModel/constant/transportProperties2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu		[0 2 -1 0 0 0 0] Viscorig;
nuBulk		[0 2 -1 0 0 0 0] Visc_Bulk;

nu_walls	[0 2 -1 0 0 0 0] Visc_walls;
dist_walls	[0 1 0 0 0 0 0] Dist_walls;

nu_fixedWalls_organic	[0 2 -1 0 0 0 0] Visc_fixedWalls_org;
dist_fixedWalls_organic	[0 1 0 0 0 0 0] Dist_fixedWalls_org;

nu_fixedWalls_inorganic	[0 2 -1 0 0 0 0] Visc_fixedWalls_inorg;
dist_fixedWalls_inorganic	[0 1 0 0 0 0 0] Dist_fixedWalls_inorg;

nu_fixedWalls_clay	[0 2 -1 0 0 0 0] Visc_fixedWalls_clay;
dist_fixedWalls_clay	[0 1 0 0 0 0 0] Dist_fixedWalls_clay;

// ************************************************************************* //
