tutorials/multicomponentModel/system/fvSolution_orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    U
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        0;
        relTol           0.1;
    }
    p
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.1;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration on;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

  
    Yi 
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.1;
    }
    
    YiFinal
    {
       $Yi
       relTol 0;
    }
}

SIMPLE
{
    pRefCell 0;
    pRefValue 0;
    
    nCorrectors 2;
    nNonOrthogonalCorrectors 0; // No need unless mesh is non-orthogonal
    consistent yes;

    residualControl
    {
        p               1e-7;
        U               1e-7;
    } 
}

relaxationFactors
{
       U 0.5;
       p 0.3;
}




// ************************************************************************* //
