tutorials/multicomponentModel/system/SPDict
FoamFile
{
version     4.0;
format      ascii;
class       dictionary;
location    "system";
object      postProcessDict;
}

poro 0.409261 ;
perm 2.4579e-17 ;
