tutorials/multicomponentModel/system/postProcessDict
FoamFile
{
version     4.0;
format      ascii;
class       dictionary;
location    "system";
object      postProcessDict;
}

velocity volumeAveraged;
pressureDrop direct;//velocityWeightedAverageViscousForce;

inletName inlet;
outletName outlet;

x1 0;
x2 1.0000e-06;

y1 0;
y2 5.0000e-07;

z1 0;
z2 1.0000e-08;

direction 0;
